const commission = require('./commission');

// проверка:
function test(description, arg, res) {
	if(commission(arg) === res) {
		console.log(description, 'успех');
	}
	else {
		console.log(description, 'ошибка');
	}
}

test('граница = 10 дней', (Date.now() + (10 * 24 * 60 * 60 * 1000)), 0);
test('значение рядом с границей < 10 дней', (Date.now() + (10 * 24 * 60 * 60 * 1000)-1000), 20);
test('значение рядом с границей > 10 дней', (Date.now() + (10 * 24 * 60 * 60 * 1000)+1000), 0);

test('граница = 5 дней', (Date.now() + (5 * 24 * 60 * 60 * 1000)), 20);
test('значение рядом с границей < 5 дней', (Date.now() + (5 * 24 * 60 * 60 * 1000)-1000), 50);
test('значение рядом с границей > 5 дней', (Date.now() + (5 * 24 * 60 * 60 * 1000)+1000), 20);

test('граница = 24 часа', (Date.now() + (24 * 60 * 60 * 1000)), 50);
test('значение рядом с границей < 24 часа', (Date.now() + (24 * 60 * 60 * 1000)-1000), 75);
test('значение рядом с границей > 24 часа', (Date.now() + (24 * 60 * 60 * 1000)+1000), 50);

test('граница = 0 секунд', (Date.now()), 75);
test('значение рядом с границей < 0 секунд', (Date.now() - 1000), 100);
test('значение рядом с границей > 0 секунд', (Date.now() + 1000), 75);
